[
  {
    "image": "https://play-lh.googleusercontent.com/GK0SwEBVqlFBpRkPjY6y_1go6E6xZzAN0Ivzfgbuf28J4TTOoOsgWnqR4oJ_RhIhsg",
    "title": "Todoist",
    "companyName": "Doist Inc",
    "id": 1,
    "description": "Todoist is a cross-platform task and to-do list manager that helps individuals and teams stay organized and productive. Using natural language input, users can quickly capture tasks (e.g. “Submit report tomorrow at 3pm”) and Todoist interprets dates, labels, and project tags. It offers flexible views including lists, boards (Kanban), and calendar layouts, allowing you to see what’s due now or upcoming. Tasks can have sub-tasks, priority levels, and reminders (premium). Collaboration is built in: you can assign tasks, leave comments, share projects, and attach files. Todoist also provides productivity insights, task visualizations, custom filters, and integrates with many tools (e.g. calendars, email). With seamless syncing across devices, it’s a robust yet intuitive productivity solution.",
    "size": 45,
    "reviews": "1.2K",
    "ratingAvg": 4.5,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 3500 }
    ]
  },
  {
    "image": "https://cdn.mos.cms.futurecdn.net/v2/t:0,l:300,cw:900,ch:900,q:80,w:900/A3xd28kpmHUxxpSV9u2hyK.jpg",
    "title": "Snapseed",
    "companyName": "Google LLC",
    "id": 2,
    "description": "Snapchat lets you stay connected with friends through fun and temporary photos and videos called Snaps. Users can add filters, lenses, and effects to make their moments creative. The app also includes chat, voice, and video call options. With Stories, you can share your daily highlights for 24 hours, while the Spotlight feature showcases viral short videos. Snapchat emphasizes real connections and privacy—Snaps disappear after being viewed. It’s popular among young audiences for its authenticity, creativity, and quick sharing. Every moment on Snapchat feels spontaneous and real.",
    "size": 80,
    "reviews": "34M",
    "ratingAvg": 4.6,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 78000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/DtR_W1lA1tKsbrr2DUo3TLNzqi9qRyxPqDuCyJeGLU6OMJKqg7CEqs45btRqvDFNDI3Y",
    "title": "MyFitnessPal",
    "companyName": "MyFitnessPal, Inc.",
    "id": 3,
    "description": "MyFitnessPal is a powerful health and fitness app designed to help you track your diet, exercise, and lifestyle to reach your wellness goals. With a vast food database of millions of items, you can log meals easily by searching, scanning barcodes, or entering custom foods. The app calculates calorie intake and macros (carbs, proteins, fats) and compares them against your daily targets. You can also log workouts—both cardio and strength training—and sync with many fitness trackers (Fitbit, Apple Watch, Garmin, etc.). MyFitnessPal provides insight via charts and trends, motivational community features, recipes, and tips. Whether you're aiming to lose weight, build muscle, or maintain health, it offers a comprehensive, user-friendly way to stay on track",
    "size": 60,
    "reviews": "2.5K",
    "ratingAvg": 4.8,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 3500 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 70000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTdeRM18Kzns6n9wCaMbKB_IXZwHEwuIjvBuw&s",
    "title": "Evernote",
    "companyName": "Evernote Corporation",
    "id": 4,
    "description": "Evernote is a versatile note-taking and organization app designed to capture, organize, and access your ideas anywhere. It lets you create notes in text, audio, photo, or document form and syncs them seamlessly across devices. You can organize your notes into notebooks, add tags, set reminders, and search instantly using powerful filters—even handwritten text in images. Evernote also supports web clipping, allowing you to save articles, PDFs, and screenshots directly from your browser. Perfect for students, professionals, and teams, it helps manage meeting notes, to-do lists, and projects in one place. With cloud syncing, offline access, and integrations with Google Drive, Slack, and Outlook, Evernote keeps your thoughts structured and accessible anytime, anywhere.",
    "size": 25,
    "reviews": "500",
    "ratingAvg": 4.2,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 20000 }
    ]
  },
  {
    "image": "https://imgcdn.latestmodapks.com/api/resize?url=https://www.latestmodapks.com/wp-content/uploads/2023/02/GB4X-Pro-Logo.png&width=160",
    "title": "Game Booster 4x Faster",
    "companyName": "G19 Mobile",
    "id": 5,
    "description": "Game Booster 4x Faster is an Android utility app designed to improve gaming performance by optimizing device resources. It offers one-tap boost, freeing up RAM and killing background tasks before you launch a game to reduce lag. Graphics tuning options (GFX tool) allow you to adjust resolution, unlock HDR effects, and increase FPS on compatible devices. It also includes a “Zero Lag Mode,” CPU cooling, a battery saver mode, and monitoring tools like HUD for network latency and storage load. Multiple modes—performance-focused, balanced, or battery-saving—let you customize how aggressively it optimizes. With AI-assisted tweaks and cleaner tools, the app aims to make gameplay smoother, especially on mid to low-end phones.",
    "size": 70,
    "reviews": "4K",
    "ratingAvg": 4.7,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 2500 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 48000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/TpK0AcjPn5-XDKgSZ5jAob1H7MsQuJILOMR4M4QYkTt5CBPgTJVr7mysrKM6Ia8SrX8",
    "title": "Khan Academy",
    "companyName": "Khan Academy",
    "id": 6,
    "description": "Khan Academy is a free educational app offering thousands of lessons for learners of all ages. It provides interactive courses, practice exercises, and video tutorials across subjects like math, science, economics, history, and computer programming. Students can learn at their own pace, track progress, and earn badges for completing milestones. The app’s clean interface and structured lessons make complex topics easy to understand. Teachers and parents can also monitor student progress through dashboards and assign personalized tasks. Khan Academy supports offline learning, allowing users to download videos and exercises. Trusted by millions worldwide, it empowers self-learners and students to build strong academic foundations anytime, anywhere—all completely free.",
    "size": 90,
    "reviews": "3K",
    "ratingAvg": 4.6,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 18000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/XskKKrerCZPR5YH9iqSNNI9RmBedf_UN5KDr6ffeypSG-yn1dBi2yRoahttm9ENqvi-d",
    "title": "Money Manager",
    "companyName": "Realbyte Inc.",
    "id": 7,
    "description": "Money Manager is a smart personal finance app that helps you track, manage, and plan your expenses efficiently. It lets you record daily income and spending with easy-to-use categories like food, transport, bills, and savings. The app automatically generates visual charts and reports to show where your money goes, helping you build better budgeting habits. You can set monthly spending limits, manage credit cards, loans, and even track recurring payments. With password protection and cloud backup, your financial data stays secure and accessible anytime. Money Manager also offers features like asset management, balance tracking, and detailed statistics for smart decision-making. It’s the perfect tool to take control of your finances and achieve your savings goals.",
    "size": 35,
    "reviews": "1K",
    "ratingAvg": 4.4,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 8000 }
    ]
  },
  {
    "image": "https://m.media-amazon.com/images/I/31B2Nyzd8XL._h1_.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 8,
    "description": "Spotify is a global music and podcast streaming app that lets users listen to millions of tracks, albums, and playlists for free. It allows you to explore personalized recommendations based on your mood, favorite artists, and listening history. Users can create custom playlists, follow artists, and share music with friends. Premium subscribers enjoy ad-free music, offline downloads, and better sound quality. Spotify also offers podcasts on various topics such as motivation, technology, and storytelling. Whether you’re relaxing, working, or studying, Spotify provides the perfect soundtrack for every moment of your day.",
    "size": 120,
    "reviews": "33M",
    "ratingAvg": 4.9,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 180000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6MtUcsS5i95q92P6NbHTGzJT6hs6cJANaMHXfW5nco5_hDOnF1AC3A5lgH3Ik3MARAry",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 9,
    "description": "YouTube is the world’s largest video-sharing platform, where billions of people watch, upload, and share videos daily. From tutorials, entertainment, and live streams to educational content and music videos, YouTube has something for everyone. Users can subscribe to favorite channels, comment, like, or share videos across social platforms. With personalized recommendations, trending sections, and the YouTube Shorts feature, users can discover new creators easily. Premium subscribers enjoy ad-free streaming, offline downloads, and background playback. Whether you are learning, relaxing, or connecting with communities, YouTube offers a seamless video experience across all devices.",
    "size": 130,
    "reviews": "145M",
    "ratingAvg": 4.4,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 115000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/bYtqbOcTYOlgc6gqZ2rwb8lptHuwlNE75zYJu6Bn076-hTmvd96HH-6v7S0YUAAJXoJN",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 1,
    "description": "WhatsApp Messenger is a fast, simple, and secure messaging app that lets you stay connected with friends and family all over the world. You can send text messages, voice notes, photos, videos, and documents instantly without any cost. WhatsApp also supports free voice and video calls, even on slow connections. It uses end-to-end encryption to keep your conversations completely private and safe from third parties. You can create group chats, share your status updates, and stay in touch anytime, anywhere. With its lightweight design, WhatsApp works smoothly on almost any smartphone, making communication effortless, reliable, and personal.",
    "size": 45,
    "reviews": 180000000,
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 3500000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 42000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/BmUViDVOKNJe0GYJe22hsr7juFndRVbvr1fGmHGXqHfJjNAXjd26bfuGRQpVrpJ6YbA",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 11,
    "description": "TikTok is a short-form video platform that allows users to create, watch, and share engaging videos with millions of people around the world. From funny skits, dance trends, and tutorials to motivational clips, TikTok has a community for every interest. The app’s advanced recommendation system personalizes your feed based on what you love watching. Users can add music, filters, and effects to make videos more creative. TikTok encourages authentic expression, connecting people across cultures through creativity and fun. Whether you’re exploring trends or creating your own, TikTok makes every second count.",
    "size": 115,
    "reviews": "55M",
    "ratingAvg": 4.5,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 36500000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQbeQEaLYtW8864NUrNmf8OtltgNKJSvhx5xA&s",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 12,
    "description": "Instagram is a social media platform where you can share your world through photos, videos, and reels. It lets users follow friends, celebrities, and creators, engage through likes, comments, and stories, and explore content that inspires creativity. With its reels and live features, you can broadcast to followers in real time. Businesses and creators use Instagram to grow audiences and showcase products. Smart filters, direct messages, and highlights make it fun and interactive. Whether for personal use or brand promotion, Instagram connects people visually across the globe in moments.",
    "size": 120,
    "reviews": "128M",
    "ratingAvg": 4.2,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 11000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 83000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/KxeSAjPTKliCErbivNiXrd6cTwfbqUJcbSRPe_IBVK_YmwckfMRS1VIHz-5cgT09yMo",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 13,
    "description": "Snapchat is a fast and fun social media app that lets you share moments instantly through photos and short videos called Snaps. You can add filters, lenses, stickers, and effects to make your snaps more expressive and creative. Messages and snaps disappear after viewing, making conversations more spontaneous and private. The app features Stories for sharing your day with friends and Spotlight for discovering trending content from creators worldwide. With Snap Map, you can see where friends are and explore global events in real time. Snapchat also includes chat, video calls, and Bitmoji avatars for a personalized experience. Designed for real connections and creativity, it’s one of the most popular platforms for authentic self-expression.",
    "size": 85,
    "reviews": "34M",
    "ratingAvg": 4.2,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 2800000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 21800000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRRJ3FDIizOpfNf8LftqUASYHnCX8pU4g1jWw&s",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 14,
    "description": "Facebook is a global social networking platform that helps people stay connected with family, friends, and communities. Users can share photos, updates, and videos, join groups, follow pages, and engage in discussions. Businesses use Facebook to promote brands, sell products, and reach target audiences through ads. The platform includes Messenger for instant chatting, video calls, and stories for personal sharing. Facebook fosters meaningful connections by enabling communication, events, and social causes. Whether you’re keeping in touch or building communities, Facebook keeps the world closer together.",
    "size": 150,
    "reviews": "190M",
    "ratingAvg": 4.1,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 12000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 18000000 },
      { "name": "4 star", "count": 32000000 },
      { "name": "5 star", "count": 122000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/ZU9cSsyIJZo6Oy7HTHiEPwZg0m2Crep-d5ZrfajqtsH-qgUXSqKpNA2FpPDTn-7qA5Q",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 15,
    "description": "Telegram is a cloud-based messaging app that prioritizes speed, privacy, and security. Users can send text messages, photos, videos, and files of any type. The app supports large group chats and channels where millions can join. Telegram includes end-to-end encryption for secret chats, bots for automation, and cross-device syncing. It’s perfect for communities, businesses, and individuals who value privacy and performance. Telegram also offers free voice and video calls and a clean interface. It’s fast, reliable, and ideal for both casual and professional communication.",
    "size": 90,
    "reviews": "16M",
    "ratingAvg": 4.5,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 3300000 },
      { "name": "5 star", "count": 10400000 }
    ]
  },
  {
    "image": "https://store-images.s-microsoft.com/image/apps.45406.9007199266244427.4d45042b-d7a5-4a83-be66-97779553b24d.2a88a418-b96d-44a6-ad4f-5e0ee6289b2c",
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "id": 16,
    "description": "Twitter, now known as X, is a real-time platform for sharing thoughts, news, and opinions with a global audience. Users can post short messages, follow trending topics, and engage in conversations on almost any subject. It’s a key source for breaking news, public discussions, and direct communication between users and influencers. With features like Spaces for live audio, premium subscriptions, and verified accounts, X enhances communication and credibility. Whether you’re following world events or sharing your voice, Twitter keeps you informed and connected.",
    "size": 80,
    "reviews": "27M",
    "ratingAvg": 4.0,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 15500000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTIh_W8s-Qkk6LU_RS5Ee0C2gyvRTepFTiuyg&s",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 17,
    "description": "Pinterest is a creative discovery and inspiration app that helps users find and save ideas for every interest or project. From fashion, home decor, and food recipes to travel, fitness, and digital design — Pinterest lets you explore millions of visual posts called Pins. You can organize your favorite ideas into themed Boards for easy access and future planning. The app’s smart recommendations suggest pins based on your interests, helping you discover fresh ideas daily. You can also follow creators, shop directly from pins, and even upload your own ideas to inspire others. Whether you’re planning a new look, decorating your home, or starting a DIY project, Pinterest turns inspiration into action — one pin at a time.",
    "size": 70,
    "reviews": "18M",
    "ratingAvg": 4.6,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 3200000 },
      { "name": "5 star", "count": 12900000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/TBRwjS_qfJCSj1m7zZB93FnpJM5fSpMA_wUlFDLxWAb45T9RmwBvQd5cWR5viJJOhkI",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 18,
    "description": "Netflix is the world’s leading streaming platform for movies, TV shows, and documentaries. With a subscription, users gain access to thousands of titles across all genres — from drama and comedy to action and anime. The app allows offline downloads, personalized recommendations, and multi-profile support for family members. Netflix Originals like Stranger Things and Money Heist have made it a global entertainment hub. Its ad-free experience, HD and 4K streaming, and smart parental controls enhance usability. Whether you’re on a mobile, tablet, or TV, Netflix delivers seamless entertainment anytime, anywhere.",
    "size": 125,
    "reviews": "18M",
    "ratingAvg": 4.5,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1400000 },
      { "name": "4 star", "count": 3300000 },
      { "name": "5 star", "count": 8300000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQkpB_v-OMIUy9uqupMzASpbe2jxKoL6fLFIg&s",
    "title": "Amazon",
    "companyName": "Amazon Mobile LLC",
    "id": 19,
    "description": "Amazon Shopping app gives you access to millions of products — from electronics and books to fashion and home essentials. With fast delivery, easy returns, and secure payments, it ensures a smooth online shopping experience. Personalized recommendations, one-click checkout, and real-time order tracking make buying effortless. Prime members enjoy exclusive deals, free delivery, and Prime Video access. The app also supports voice search, wishlist, and daily discounts. Whether you’re looking for daily essentials or premium gadgets, Amazon makes shopping smarter and more convenient worldwide.",
    "size": 120,
    "reviews": "23M",
    "ratingAvg": 4.3,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 7500000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/kMofEFLjobZy_bCuaiDogzBcUT-dz3BBbOrIEjJ-hqOabjK8ieuevGe6wlTD15QzOqw",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 20,
    "description": "LinkedIn is the world’s largest professional networking app, helping users connect, share, and grow their careers. You can create a detailed professional profile, showcase skills, and highlight experiences to attract opportunities. The app allows you to network with colleagues, industry leaders, and potential employers, as well as join groups and communities relevant to your field. Users can post updates, share articles, and engage with professional content to stay informed. LinkedIn also features job listings, company insights, and learning courses to enhance your skills. With messaging, notifications, and tailored career recommendations, LinkedIn empowers professionals to build relationships, advance their careers, and discover new opportunities anytime, anywhere.",
    "size": 90,
    "reviews": "12M",
    "ratingAvg": 4.2,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1300000 },
      { "name": "4 star", "count": 2400000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/yZsmiNjmji3ZoOuLthoVvptLB9cZ0vCmitcky4OUXNcEFV3IEQkrBD2uu5kuWRF5_ERA",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 21,
    "description": "Zoom is a leading video conferencing and online meeting app that connects people across the globe. It allows users to host or join high-quality video and audio meetings, webinars, and virtual events from any device. Features include screen sharing, real-time chat, meeting recording, and virtual backgrounds to enhance communication and collaboration. Zoom supports large meetings with hundreds of participants, breakout rooms for group discussions, and advanced security settings to protect privacy. It integrates seamlessly with calendars and productivity tools, making scheduling and joining meetings effortless. Whether for business, education, or personal use, Zoom provides a reliable and user-friendly platform for staying connected, collaborating efficiently, and maintaining productivity anytime, anywhere.",
    "size": 110,
    "reviews": "12M",
    "ratingAvg": 4.4,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2600000 },
      { "name": "5 star", "count": 7400000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/MO4jVMbqskWrBD7BDUiKkymLPDMlSFjnEE-JTCigWv6UcoENgAkSKr8bs0IvPs8Twv8",
    "title": "CapCut",
    "companyName": "Bytedance Pte. Ltd.",
    "id": 22,
    "description": "CapCut is a powerful, user-friendly video editing app designed for creating professional-quality videos on mobile devices. It offers a wide range of tools including trimming, cutting, merging, and speed adjustment, as well as advanced features like keyframe animation, chroma key (green screen), and multi-layer editing. Users can add music, sound effects, filters, stickers, and text to enhance their videos creatively. CapCut also provides trendy templates, transitions, and effects to help produce eye-catching content for social media platforms like TikTok, Instagram, and YouTube. With its intuitive interface and high-quality export options, CapCut makes video editing accessible for beginners and professionals alike, empowering users to bring their creative ideas to life anytime, anywhere.",
    "size": 160,
    "reviews": "18M",
    "ratingAvg": 4.4,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 10600000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/3aWGqSf3T_p3F6wc8FFvcZcnjWlxpZdNaqFVEvPwQ1gTOPkVoZwq6cYvfK9eCkwCXbRY",
    "title": "Canva",
    "companyName": "Canva",
    "id": 23,
    "description": "Canva is a graphic design tool that helps anyone create stunning visuals with ease. It offers templates for social media posts, posters, resumes, and business cards. With drag-and-drop functionality, millions of stock photos, and customizable fonts, design becomes fun and fast. Canva Pro users enjoy brand kits, premium templates, and background remover tools. It’s ideal for students, marketers, and content creators. Whether you’re designing online or offline, Canva empowers creativity with professional-quality results in minutes.",
    "size": 95,
    "reviews": "25M",
    "ratingAvg": 4.8,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 2900000 },
      { "name": "5 star", "count": 20200000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/J63785Y2YUoZirCgiCR9lt5ZkqnMt9rDTptm4S9TDpCDMYr5JXebfI__3UwreatUm5U",
    "title": "PUBG MOBILE",
    "companyName": "Level Infinite",
    "id": 24,
    "description": "PUBG Mobile is a thrilling battle royale game where players fight to be the last person or team standing. Dropped onto a massive island, players must scavenge for weapons, armor, and supplies while avoiding a shrinking play zone. The game features solo, duo, and squad modes, offering fast-paced, strategic gameplay with realistic graphics and immersive sound effects. PUBG Mobile includes a wide variety of maps, vehicles, and customizable character skins to enhance the gaming experience. Regular updates introduce new events, challenges, and seasonal content. With intuitive controls, competitive ranked modes, and team-based strategies, PUBG Mobile delivers an adrenaline-fueled survival experience for gamers worldwide on mobile devices.",
    "size": 750,
    "reviews": "42M",
    "ratingAvg": 4.3,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 26500000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/jHnf_3-yMox_Tub_oLKQ7OuOi8Iahf1f4rdu-etZ2hmzUOekY84znct-c8hksxhD15PYNk4dMH2ZdVY3uxm7Gw",
    "title": "Garena Free Fire",
    "companyName": "Garena International I",
    "id": 25,
    "description": "Garena Free Fire is a fast-paced battle royale game designed for mobile devices, where players compete to be the last person standing. Each match drops up to 50 players onto a remote island, where they must search for weapons, gear, and supplies while avoiding the shrinking safe zone. The game offers solo, duo, and squad modes, along with a variety of characters, each with unique abilities, to suit different play styles. Free Fire features intuitive controls, dynamic maps, and vehicles for tactical gameplay. Regular updates provide new events, skins, and challenges, keeping the experience fresh. With its quick matches, strategic combat, and vibrant graphics, Free Fire delivers an exciting survival experience anytime, anywhere.",
    "size": 600,
    "reviews": "95M",
    "ratingAvg": 4.2,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 63000000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/FVWs-cooG28tz3GuKSaBKW_Rp91wLJxGxlmB9et_r-chKrjWpvXGxtRJWQi0QKithdM=w256",
    "title": "Subway Surfers",
    "companyName": "SYBO Games",
    "id": 26,
    "description": "Subway Surfers is a popular endless runner mobile game where players dash through colorful subway tracks, dodging trains and obstacles while collecting coins and power-ups. You play as a young graffiti artist who runs from the inspector and his dog, performing thrilling jumps, slides, and rolls. The game features vibrant graphics, smooth controls, and dynamic environments that change with each city-themed update. Players can unlock new characters, hoverboards, and special abilities, enhancing gameplay and increasing scores. Daily missions, challenges, and global leaderboards add competitive excitement, encouraging players to improve and compete with friends worldwide. With simple yet addictive gameplay, Subway Surfers provides endless fun for all ages, making it one of the most beloved mobile games globally.",
    "size": 180,
    "reviews": "39M",
    "ratingAvg": 4.6,
    "downloads": 2,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1800000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 30600000 }
    ]
  },
  {
    "image": "https://m.media-amazon.com/images/I/81Z+V7GJIEL._h1_.png",
    "title": "Clash of Clans",
    "companyName": "Supercell",
    "id": 27,
    "description": "Clash of Clans is a popular strategy mobile game where players build and upgrade their villages, train troops, and battle other players to earn resources and trophies. You can join clans, participate in clan wars, and collaborate with friends to defend against attacks or plan coordinated strikes. The game features a variety of troops, spells, and heroes, each with unique abilities, allowing for diverse tactical strategies. Players must balance resource management, village defense, and attack strategies to progress. Regular updates introduce new challenges, events, and seasonal content, keeping the gameplay fresh. With engaging combat, strategic depth, and a vibrant community, Clash of Clans offers an immersive and competitive experience for strategy enthusiasts worldwide.",
    "size": 300,
    "reviews": "63M",
    "ratingAvg": 4.6,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 900000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 49100000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/TLUeelx8wcpEzf3hoqeLxPs3ai1tdGtAZTIFkNqy3gbDp1NPpNFTOzSFJDvZ9narFS0",
    "title": "Candy Crush Saga",
    "companyName": "King",
    "id": 28,
    "description": "Candy Crush Saga is a colorful and addictive match-3 puzzle game where players swap and match candies to complete levels and achieve high scores. With hundreds of levels, each offering unique challenges, players must plan moves carefully to clear obstacles, reach objectives, and earn rewards. The game features boosters, special candies, and power-ups that add strategic depth and excitement to gameplay. Players can connect with friends, compete on leaderboards, and participate in special events for extra rewards. With vibrant graphics, cheerful animations, and an engaging soundtrack, Candy Crush Saga provides hours of fun and mental stimulation. Its easy-to-learn but challenging-to-master mechanics make it a favorite casual game for players of all ages.",
    "size": 250,
    "reviews": "36M",
    "ratingAvg": 4.5,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5500000 },
      { "name": "5 star", "count": 26600000 }
    ]
  }
]
